-- 1
SELECT Н_ТИПЫ_ВЕДОМОСТЕЙ.ИД, Н_ВЕДОМОСТИ.ИД FROM Н_ТИПЫ_ВЕДОМОСТЕЙ 
LEFT JOIN Н_ВЕДОМОСТИ ON Н_ВЕДОМОСТИ.ВЕД_ИД = Н_ТИПЫ_ВЕДОМОСТЕЙ.ИД
WHERE Н_ТИПЫ_ВЕДОМОСТЕЙ.НАИМЕНОВАНИЕ = 'Экзаменационный лист' AND
Н_ВЕДОМОСТИ.ДАТА > '2022-06-08' AND Н_ВЕДОМОСТИ.ДАТА = '1998-01-05';
-- 2
SELECT Н_ЛЮДИ.ФАМИЛИЯ, Н_ОБУЧЕНИЯ.НЗК, Н_УЧЕНИКИ.НАЧАЛО FROM Н_ЛЮДИ
LEFT JOIN Н_ОБУЧЕНИЯ ON Н_ОБУЧЕНИЯ.ЧЛВК_ИД = Н_ЛЮДИ.ИД 
LEFT JOIN Н_УЧЕНИКИ ON Н_УЧЕНИКИ.ЧЛВК_ИД = Н_ОБУЧЕНИЯ.ЧЛВК_ИД AND Н_УЧЕНИКИ.ВИД_ОБУЧ_ИД = Н_ОБУЧЕНИЯ.ВИД_ОБУЧ_ИД
WHERE Н_ЛЮДИ.ИМЯ < 'Александр' AND CAST(Н_ОБУЧЕНИЯ.НЗК AS INTEGER) > 933232;
-- 3
SELECT COUNT(Н_ЛЮДИ.ИД) FROM Н_ЛЮДИ
INNER JOIN Н_УЧЕНИКИ ON Н_УЧЕНИКИ.ЧЛВК_ИД = Н_ЛЮДИ.ИД 
INNER JOIN Н_ПЛАНЫ ON Н_УЧЕНИКИ.ПЛАН_ИД = Н_ПЛАНЫ.ИД
INNER JOIN Н_ОТДЕЛЫ ON Н_ПЛАНЫ.ОТД_ИД = Н_ОТДЕЛЫ.ИД
WHERE Н_ОТДЕЛЫ.КОРОТКОЕ_ИМЯ = 'КТиУ' AND Н_ЛЮДИ.ИНН IS NULL;
-- 4
SELECT Н_ГРУППЫ_ПЛАНОВ.ГРУППА FROM Н_ГРУППЫ_ПЛАНОВ
WHERE (
SELECT  COUNT(Н_УЧЕНИКИ.ИД) FROM Н_УЧЕНИКИ
INNER JOIN Н_ПЛАНЫ ON Н_УЧЕНИКИ.ПЛАН_ИД = Н_ПЛАНЫ.ИД
INNER JOIN Н_ОТДЕЛЫ ON Н_ПЛАНЫ.ОТД_ИД = Н_ОТДЕЛЫ.ИД
WHERE Н_ОТДЕЛЫ.КОРОТКОЕ_ИМЯ = 'ВТ' AND Н_ГРУППЫ_ПЛАНОВ.ГРУППА = Н_УЧЕНИКИ.ГРУППА 
AND Н_ГРУППЫ_ПЛАНОВ.ПЛАН_ИД = Н_УЧЕНИКИ.ПЛАН_ИД AND DATE_PART('year', Н_УЧЕНИКИ.НАЧАЛО) = 2011
) = 5; 
-- 5
WITH STUDENTS AS (SELECT Н_ЛЮДИ.ИД AS ИД, CONCAT(Н_ЛЮДИ.ФАМИЛИЯ, ' ', Н_ЛЮДИ.ИМЯ, ' ', Н_ЛЮДИ.ОТЧЕСТВО) AS ФИО, AVG(CAST(Н_ВЕДОМОСТИ.ОЦЕНКА AS INTEGER)) AS СР_ОЦ, Н_УЧЕНИКИ.ГРУППА
FROM Н_ЛЮДИ JOIN Н_УЧЕНИКИ ON Н_УЧЕНИКИ.ЧЛВК_ИД = Н_ЛЮДИ.ИД JOIN Н_ВЕДОМОСТИ ON Н_ВЕДОМОСТИ.ЧЛВК_ИД = Н_ЛЮДИ.ИД
WHERE Н_ВЕДОМОСТИ.ОЦЕНКА IN ('1', '2', '3', '4', '5')
GROUP BY Н_ЛЮДИ.ИД,Н_ЛЮДИ.ИМЯ, Н_ЛЮДИ.ФАМИЛИЯ, Н_ЛЮДИ.ОТЧЕСТВО, ГРУППА)
SELECT ИД, ФИО, СР_ОЦ FROM STUDENTS
WHERE ГРУППА = '4100' AND СР_ОЦ >= (SELECT MIN(СР_ОЦ) FROM STUDENTS WHERE ГРУППА = '1100');
--6
 select Н_ЛЮДИ.ИД, Н_ЛЮДИ.ФАМИЛИЯ, Н_ЛЮДИ.ИМЯ, Н_ЛЮДИ.ОТЧЕСТВО, Н_УЧЕНИКИ.ГРУППА,  Н_УЧЕНИКИ.П_ПРКОК_ИД 
 from Н_УЧЕНИКИ JOIN Н_ЛЮДИ ON Н_УЧЕНИКИ.ЧЛВК_ИД = Н_ЛЮДИ.ИД
 where Н_УЧЕНИКИ.ПРИЗНАК = 'отчисл' AND DATE(Н_УЧЕНИКИ.КОНЕЦ_ПО_ПРИКАЗУ) = '2012-09-01' 
 AND EXISTS(SELECT * FROM Н_ПЛАНЫ WHERE Н_ПЛАНЫ.ИД = Н_УЧЕНИКИ.ПЛАН_ИД AND ФО_ИД IN (SELECT DISTINCT ИД FROM Н_ФОРМЫ_ОБУЧЕНИЯ WHERE НАИМЕНОВАНИЕ IN ('Очная', 'Заочная')));
 --7
 select * from Н_ЛЮДИ where ИД NOT IN (SELECT ЧЛВК_ИД FROM Н_УЧЕНИКИ);